; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-55)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc4)
    (at car1 loc10)
    (at car2 loc2)
    (at car3 loc6)
    (at car4 loc4)
    (at car5 loc4)
    (at car6 loc8)
    (at car7 loc6)
    (at car8 loc10)
    (at car9 loc4)
    (at car10 loc7)
)
 (:goal (and 
(at car10 loc8)
))
)

; plan
1. (sail loc4 loc7)
   deleted: (at-ferry loc4)
   added: (at-ferry loc7)
   goals met: 0 of 1
2. (board car10 loc7)
   deleted: (at car10 loc7) (empty-ferry)
   added: (on car10)
   goals met: 0 of 1
3. (sail loc7 loc8)
   deleted: (at-ferry loc7)
   added: (at-ferry loc8)
   goals met: 0 of 1
4. (debark car10 loc8)
   deleted: (on car10)
   added: (at car10 loc8) (empty-ferry)
   goals met: 1 of 1
